<?php
session_start();
if (!isset($_SESSION["empData"])) {
    Header("Location: ../login-page");
}
require_once('../assets/vendor/TCPDF/tcpdf.php');

$pdf = new TCPDF('P', 'mm', 'A4', true, 'UTF-8', false);

// define('Sarabun', TCPDF_FONTS::addTTFfont('../assets/fonts/Sarabun-Regular.ttf', 'TrueTypeUnicode'));
// define('SarabunB', TCPDF_FONTS::addTTFfont('../assets/fonts/Sarabun-Bold.ttf', 'TrueTypeUnicode'));
// $font = $pdf->addTTFfont("filename.ttf");
$pdf->SetCreator(PDF_CREATOR);

$pdf->setPrintHeader(false);
$pdf->setPrintFooter(false);

$pdf->SetMargins(PDF_MARGIN_LEFT, PDF_MARGIN_TOP, PDF_MARGIN_RIGHT);
$pdf->SetHeaderMargin(PDF_MARGIN_HEADER);
$pdf->SetFooterMargin(PDF_MARGIN_FOOTER);

$pdf->SetAutoPageBreak(TRUE, PDF_MARGIN_BOTTOM);
$pdf->SetMargins(15, 8, null, true);
$pdf->SetAutoPageBreak(TRUE, 0);
$pdf->AddPage();

$pdf->SetFont('thsarabunb', '', 18);
$pdf->Cell(150, 0, "ใบส่งซ่อมครุภัณฑ์คณะวิทยาการสารสนเทศ             ", 0, 0, 'R');
$pdf->SetFont('thsarabun', '', 13);
$pdf->Cell(30, 0, "ต้นฉบับ          ", 0, 1, 'R');

$pdf->SetFont('thsarabun', '', 16);
$pdf->Cell(180, 0, "", 0, 1, 'C');
$pdf->Cell(180, 3, "วันที่.......................เดือน..............................พ.ศ...................", 0, 1, 'R');
$pdf->Cell(84, 0, "       รายการสินค้าที่ส่งซ่อม........................................................", 0, 0, 'L');
$pdf->Cell(96, 0, "หมายเลขครุภัณฑ์..................................................................", 0, 1, 'R');
$pdf->Cell(60, 0, "ยี่ห้อ...........................................................", 0, 0, 'L');
$pdf->Cell(60, 0, "รุ่น...........................................", 0, 0, 'L');
$pdf->Cell(60, 0, "วัน/เดือน/ปีที่ซื้อสินค้า.............................................", 0, 1, 'R');
$pdf->Cell(90, 0, "โดยให้นาย/นาง/นางสาว..........................................................", 0, 0, 'L');
$pdf->Cell(90, 0, "ซึ่งเป็นพนักงานของบริษัท.........................................................", 0, 1, 'R');
$pdf->Cell(90, 0, "หมายเลขบัตรประชาชน..............................................................", 0, 0, 'L');
$pdf->Cell(90, 0, "ได้รับครุภัณฑ์ดังกล่าวไปดำเนินการซ่อมเรียบร้อยแล้ว  ทั้งนี้", 0, 1, 'R');
$pdf->Cell(70, 0, "เมื่อดำเนินการซ่อมเสร็จแล้วจะส่งคืนภายใน", 0, 0, 'L');
$pdf->Cell(110, 0, "วันที่.......................เดือน...................................................พ.ศ......................", 0, 1, 'L');
$pdf->Cell(180, 11, "", 0, 1, 'C');
$pdf->Cell(60, 0, "...........................................................", 0, 0, 'L');
$pdf->Cell(60, 0, "...........................................................", 0, 0, 'C');
$pdf->Cell(60, 0, "...........................................................", 0, 1, 'R');
$pdf->Cell(60, 0, "(...........................................................)", 0, 0, 'L');
$pdf->Cell(60, 0, "(...........................................................)", 0, 0, 'C');
$pdf->Cell(60, 0, "(..........................................................)", 0, 1, 'R');
$pdf->Cell(60, 0, "               ผู้อนุมัติซ่อม", 0, 0, 'L');
$pdf->Cell(60, 0, "  พนักงานรับซ่อมของบริษัท", 0, 0, 'C');
$pdf->Cell(60, 0, "               นักวิชาการพัสดุ", 0, 1, 'L');
$pdf->Cell(180, 5, "", 0, 1, 'C');
$pdf->Cell(60, 0, "*** กรณีที่ส่งคืนสินค้าหลังจากซ่อมเสร็จแล้ว", 0, 1, 'L');
$pdf->Cell(100, 0, "ข้าพเจ้าได้รับครุภัณฑ์ที่ดำเนินการส่งซ่อมเรียบร้อยแล้ว", 0, 0, 'R');
$pdf->Cell(80, 0, "  ตั้งแต่วันที่..............เดือน..........................พ.ศ..............", 0, 1, 'R');

$pdf->Cell(180, 3, "", 0, 1, 'C');
$pdf->Cell(180, 0, ".............................................................", 0, 1, 'R');
$pdf->Cell(180, 0, "(...........................................................)", 0, 1, 'R');
$pdf->Cell(180, 0, "ตำแหน่ง................................................", 0, 1, 'R');

$pdf->Cell(180, 0, "____________________________________________________________________________________________________", 0, 1, 'C');

$pdf->SetFont('thsarabunb', '', 18);
// $pdf->Cell(180, 0, "", 0, 1, 'C');
$pdf->Cell(150, 0, "ใบส่งซ่อมครุภัณฑ์คณะวิทยาการสารสนเทศ             ", 0, 0, 'R');
$pdf->SetFont('thsarabun', '', 13);
$pdf->Cell(30, 0, "คู่ฉบับ          ", 0, 1, 'R');

$pdf->SetFont('thsarabun', '', 16);
$pdf->Cell(180, 0, "", 0, 1, 'C');
$pdf->Cell(180, 3, "วันที่.......................เดือน..............................พ.ศ...................", 0, 1, 'R');
$pdf->Cell(84, 0, "       รายการสินค้าที่ส่งซ่อม........................................................", 0, 0, 'L');
$pdf->Cell(96, 0, "หมายเลขครุภัณฑ์..................................................................", 0, 1, 'R');
$pdf->Cell(60, 0, "ยี่ห้อ...........................................................", 0, 0, 'L');
$pdf->Cell(60, 0, "รุ่น...........................................", 0, 0, 'L');
$pdf->Cell(60, 0, "วัน/เดือน/ปีที่ซื้อสินค้า.............................................", 0, 1, 'R');
$pdf->Cell(90, 0, "โดยให้นาย/นาง/นางสาว..........................................................", 0, 0, 'L');
$pdf->Cell(90, 0, "ซึ่งเป็นพนักงานของบริษัท.........................................................", 0, 1, 'R');
$pdf->Cell(90, 0, "หมายเลขบัตรประชาชน..............................................................", 0, 0, 'L');
$pdf->Cell(90, 0, "ได้รับครุภัณฑ์ดังกล่าวไปดำเนินการซ่อมเรียบร้อยแล้ว  ทั้งนี้", 0, 1, 'R');
$pdf->Cell(70, 0, "เมื่อดำเนินการซ่อมเสร็จแล้วจะส่งคืนภายใน", 0, 0, 'L');
$pdf->Cell(110, 0, "วันที่.......................เดือน...................................................พ.ศ......................", 0, 1, 'L');
$pdf->Cell(180, 11, "", 0, 1, 'C');
$pdf->Cell(60, 0, "...........................................................", 0, 0, 'L');
$pdf->Cell(60, 0, "...........................................................", 0, 0, 'C');
$pdf->Cell(60, 0, "...........................................................", 0, 1, 'R');
$pdf->Cell(60, 0, "(...........................................................)", 0, 0, 'L');
$pdf->Cell(60, 0, "(...........................................................)", 0, 0, 'C');
$pdf->Cell(60, 0, "(..........................................................)", 0, 1, 'R');
$pdf->Cell(60, 0, "               ผู้อนุมัติซ่อม", 0, 0, 'L');
$pdf->Cell(60, 0, "  พนักงานรับซ่อมของบริษัท", 0, 0, 'C');
$pdf->Cell(60, 0, "               นักวิชาการพัสดุ", 0, 1, 'L');
$pdf->Cell(180, 5, "", 0, 1, 'C');
$pdf->Cell(60, 0, "*** กรณีที่ส่งคืนสินค้าหลังจากซ่อมเสร็จแล้ว", 0, 1, 'L');
$pdf->Cell(100, 0, "ข้าพเจ้าได้รับครุภัณฑ์ที่ดำเนินการส่งซ่อมเรียบร้อยแล้ว", 0, 0, 'R');
$pdf->Cell(80, 0, "  ตั้งแต่วันที่..............เดือน..........................พ.ศ..............", 0, 1, 'R');

$pdf->Cell(180, 3, "", 0, 1, 'C');
$pdf->Cell(180, 0, ".............................................................", 0, 1, 'R');
$pdf->Cell(180, 0, "(...........................................................)", 0, 1, 'R');
$pdf->Cell(180, 0, "ตำแหน่ง................................................", 0, 1, 'R');





$pdf->Output('ใบส่งซ่อมครุภัณฑ์คณะวิทยาการสารสนเทศ.pdf', 'I');
$pdf->Close();
